# AlignDistribute2D

## Description
2D Object Alignment/Distribution

```pascal
PROCEDURE AlignDistribute2D(
				MenuAction           : LONGINT;
				VAR AlignDist2DParms : LONGINT);
```

```python
def vs.AlignDistribute2D(MenuAction):
    return AlignDist2DParms
```

## Parameters
|Name|Type|Description|
|---|---|---|
|MenuAction|LONGINT|   |
|AlignDist2DParms|LONGINT|   |

## Version
Availability: from Vectorworks 2014

## Category
* General Edit